TexasInstruments/CC26XX-TCAN4550-EXAMPLES/source/ti/can/tcan4x5x/TCAN4x5x_Reg.h
// DBTP
#define REG_BITS_MCAN_DBTP_TDC_EN					0x00800000

// TEST
#define REG_BITS_MCAN_TEST_RX_DOM					0x00000000
#define REG_BITS_MCAN_TEST_RX_REC					0x00000080
#define REG_BITS_MCAN_TEST_TX_SP					0x00000020
#define REG_BITS_MCAN_TEST_TX_DOM					0x00000040
#define REG_BITS_MCAN_TEST_TX_REC					0x00000060
#define REG_BITS_MCAN_TEST_LOOP_BACK				0x00000010

// CCCR
#define REG_BITS_MCAN_CCCR_RESERVED_MASK			0xFFFF0C00
#define REG_BITS_MCAN_CCCR_NISO_ISO					0x00000000
#define REG_BITS_MCAN_CCCR_NISO_BOSCH				0x00008000
#define REG_BITS_MCAN_CCCR_TXP						0x00004000
#define REG_BITS_MCAN_CCCR_EFBI						0x00002000
#define REG_BITS_MCAN_CCCR_PXHD_DIS					0x00001000
#define REG_BITS_MCAN_CCCR_BRSE						0x00000200
#define REG_BITS_MCAN_CCCR_FDOE						0x00000100
#define REG_BITS_MCAN_CCCR_TEST						0x00000080
#define REG_BITS_MCAN_CCCR_DAR_DIS					0x00000040
#define REG_BITS_MCAN_CCCR_MON						0x00000020
#define REG_BITS_MCAN_CCCR_CSR						0x00000010
#define REG_BITS_MCAN_CCCR_CSA						0x00000008
#define REG_BITS_MCAN_CCCR_ASM						0x00000004
#define REG_BITS_MCAN_CCCR_CCE						0x00000002
#define REG_BITS_MCAN_CCCR_INIT						0x00000001

// IE
#define REG_BITS_MCAN_IE_ARAE						0x20000000
#define REG_BITS_MCAN_IE_PEDE						0x10000000
#define REG_BITS_MCAN_IE_PEAE						0x08000000
#define REG_BITS_MCAN_IE_WDIE						0x04000000
#define REG_BITS_MCAN_IE_BOE						0x02000000
#define REG_BITS_MCAN_IE_EWE						0x01000000
#define REG_BITS_MCAN_IE_EPE						0x00800000
#define REG_BITS_MCAN_IE_ELOE						0x00400000
#define REG_BITS_MCAN_IE_BEUE						0x00200000
#define REG_BITS_MCAN_IE_BECE						0x00100000
#define REG_BITS_MCAN_IE_DRXE						0x00080000
#define REG_BITS_MCAN_IE_TOOE						0x00040000
#define REG_BITS_MCAN_IE_MRAFE						0x00020000
#define REG_BITS_MCAN_IE_TSWE						0x00010000
#define REG_BITS_MCAN_IE_TEFLE						0x00008000
#define REG_BITS_MCAN_IE_TEFFE						0x00004000
#define REG_BITS_MCAN_IE_TEFWE						0x00002000
#define REG_BITS_MCAN_IE_TEFNE						0x00001000
#define REG_BITS_MCAN_IE_TFEE						0x00000800
#define REG_BITS_MCAN_IE_TCFE						0x00000400
#define REG_BITS_MCAN_IE_TCE						0x00000200
#define REG_BITS_MCAN_IE_HPME						0x00000100
#define REG_BITS_MCAN_IE_RF1LE						0x00000080
#define REG_BITS_MCAN_IE_RF1FE						0x00000040
#define REG_BITS_MCAN_IE_RF1WE						0x00000020
#define REG_BITS_MCAN_IE_RF1NE						0x00000010
#define REG_BITS_MCAN_IE_RF0LE						0x00000008
#define REG_BITS_MCAN_IE_RF0FE						0x00000004
#define REG_BITS_MCAN_IE_RF0WE						0x00000002
#define REG_BITS_MCAN_IE_RF0NE						0x00000001

// IR
#define REG_BITS_MCAN_IR_ARA						0x20000000
#define REG_BITS_MCAN_IR_PED						0x10000000
#define REG_BITS_MCAN_IR_PEA						0x08000000
#define REG_BITS_MCAN_IR_WDI						0x04000000
#define REG_BITS_MCAN_IR_BO							0x02000000
#define REG_BITS_MCAN_IR_EW							0x01000000
#define REG_BITS_MCAN_IR_EP							0x00800000
#define REG_BITS_MCAN_IR_ELO						0x00400000
#define REG_BITS_MCAN_IR_BEU						0x00200000
#define REG_BITS_MCAN_IR_BEC						0x00100000
#define REG_BITS_MCAN_IR_DRX						0x00080000
#define REG_BITS_MCAN_IR_TOO						0x00040000
#define REG_BITS_MCAN_IR_MRAF						0x00020000
#define REG_BITS_MCAN_IR_TSW						0x00010000
#define REG_BITS_MCAN_IR_TEFL						0x00008000
#define REG_BITS_MCAN_IR_TEFF						0x00004000
#define REG_BITS_MCAN_IR_TEFW						0x00002000
#define REG_BITS_MCAN_IR_TEFN						0x00001000
#define REG_BITS_MCAN_IR_TFE						0x00000800
#define REG_BITS_MCAN_IR_TCF						0x00000400
#define REG_BITS_MCAN_IR_TC							0x00000200
#define REG_BITS_MCAN_IR_HPM						0x00000100
#define REG_BITS_MCAN_IR_RF1L						0x00000080
#define REG_BITS_MCAN_IR_RF1F						0x00000040
#define REG_BITS_MCAN_IR_RF1W						0x00000020
#define REG_BITS_MCAN_IR_RF1N						0x00000010
#define REG_BITS_MCAN_IR_RF0L						0x00000008
#define REG_BITS_MCAN_IR_RF0F						0x00000004
#define REG_BITS_MCAN_IR_RF0W						0x00000002
#define REG_BITS_MCAN_IR_RF0N						0x00000001

// ILS
#define REG_BITS_MCAN_IE_ARAL						0x20000000
#define REG_BITS_MCAN_IE_PEDL						0x10000000
#define REG_BITS_MCAN_IE_PEAL						0x08000000
#define REG_BITS_MCAN_IE_WDIL						0x04000000
#define REG_BITS_MCAN_IE_BOL						0x02000000
#define REG_BITS_MCAN_IE_EWL						0x01000000
#define REG_BITS_MCAN_IE_EPL						0x00800000
#define REG_BITS_MCAN_IE_ELOL						0x00400000
#define REG_BITS_MCAN_IE_BEUL						0x00200000
#define REG_BITS_MCAN_IE_BECL						0x00100000
#define REG_BITS_MCAN_IE_DRXL						0x00080000
#define REG_BITS_MCAN_IE_TOOL						0x00040000
#define REG_BITS_MCAN_IE_MRAFL						0x00020000
#define REG_BITS_MCAN_IE_TSWL						0x00010000
#define REG_BITS_MCAN_IE_TEFLL						0x00008000
#define REG_BITS_MCAN_IE_TEFFL						0x00004000
#define REG_BITS_MCAN_IE_TEFWL						0x00002000
#define REG_BITS_MCAN_IE_TEFNL						0x00001000
#define REG_BITS_MCAN_IE_TFEL						0x00000800
#define REG_BITS_MCAN_IE_TCFL						0x00000400
#define REG_BITS_MCAN_IE_TCL						0x00000200
#define REG_BITS_MCAN_IE_HPML						0x00000100
#define REG_BITS_MCAN_IE_RF1LL						0x00000080
#define REG_BITS_MCAN_IE_RF1FL						0x00000040
#define REG_BITS_MCAN_IE_RF1WL						0x00000020
#define REG_BITS_MCAN_IE_RF1NL						0x00000010
#define REG_BITS_MCAN_IE_RF0LL						0x00000008
#define REG_BITS_MCAN_IE_RF0FL						0x00000004
#define REG_BITS_MCAN_IE_RF0WL						0x00000002
#define REG_BITS_MCAN_IE_RF0NL						0x00000001

// ILE
#define REG_BITS_MCAN_ILE_EINT1						0x00000002
#define REG_BITS_MCAN_ILE_EINT0						0x00000001

// GFC
#define REG_BITS_MCAN_GFC_ANFS_FIFO0				0x00000000
#define REG_BITS_MCAN_GFC_ANFS_FIFO1				0x00000010
#define REG_BITS_MCAN_GFC_ANFE_FIFO0				0x00000000
#define REG_BITS_MCAN_GFC_ANFE_FIFO1				0x00000004
#define REG_BITS_MCAN_GFC_RRFS						0x00000002
#define REG_BITS_MCAN_GFC_RRFE						0x00000001
#define REG_BITS_MCAN_GFC_MASK                      0x0000003F

// NDAT1

// NDAT2

// RXF0C
#define REG_BITS_MCAN_RXF0C_F0OM_OVERWRITE			0x80000000

// RXESC
#define REG_BITS_MCAN_RXESC_RBDS_8B					0x00000000
#define REG_BITS_MCAN_RXESC_RBDS_12B				0x00000100
#define REG_BITS_MCAN_RXESC_RBDS_16B				0x00000200
#define REG_BITS_MCAN_RXESC_RBDS_20B				0x00000300
#define REG_BITS_MCAN_RXESC_RBDS_24B				0x00000400
#define REG_BITS_MCAN_RXESC_RBDS_32B				0x00000500
#define REG_BITS_MCAN_RXESC_RBDS_48B				0x00000600
#define REG_BITS_MCAN_RXESC_RBDS_64B				0x00000700
#define REG_BITS_MCAN_RXESC_F1DS_8B					0x00000000
#define REG_BITS_MCAN_RXESC_F1DS_12B				0x00000010
#define REG_BITS_MCAN_RXESC_F1DS_16B				0x00000020
#define REG_BITS_MCAN_RXESC_F1DS_20B				0x00000030
#define REG_BITS_MCAN_RXESC_F1DS_24B				0x00000040
#define REG_BITS_MCAN_RXESC_F1DS_32B				0x00000050
#define REG_BITS_MCAN_RXESC_F1DS_48B				0x00000060
#define REG_BITS_MCAN_RXESC_F1DS_64B				0x00000070
#define REG_BITS_MCAN_RXESC_F0DS_8B					0x00000000
#define REG_BITS_MCAN_RXESC_F0DS_12B				0x00000001
#define REG_BITS_MCAN_RXESC_F0DS_16B				0x00000002
#define REG_BITS_MCAN_RXESC_F0DS_20B				0x00000003
#define REG_BITS_MCAN_RXESC_F0DS_24B				0x00000004
#define REG_BITS_MCAN_RXESC_F0DS_32B				0x00000005
#define REG_BITS_MCAN_RXESC_F0DS_48B				0x00000006
#define REG_BITS_MCAN_RXESC_F0DS_64B				0x00000007

