TexasInstruments/CC26XX-TCAN4550-EXAMPLES/source/ti/can/tcan4x5x/TCAN4x5x_Reg.h
// TXBC
#define REG_BITS_MCAN_TXBC_TFQM						0x40000000

// TXESC
#define REG_BITS_MCAN_TXESC_TBDS_8					0x00000000
#define REG_BITS_MCAN_TXESC_TBDS_12					0x00000001
#define REG_BITS_MCAN_TXESC_TBDS_16					0x00000002
#define REG_BITS_MCAN_TXESC_TBDS_20					0x00000003
#define REG_BITS_MCAN_TXESC_TBDS_24					0x00000004
#define REG_BITS_MCAN_TXESC_TBDS_32					0x00000005
#define REG_BITS_MCAN_TXESC_TBDS_48					0x00000006
#define REG_BITS_MCAN_TXESC_TBDS_64					0x00000007

// TSCC
#define REG_BITS_MCAN_TSCC_PRESCALER_MASK			0x000F0000
#define REG_BITS_MCAN_TSCC_COUNTER_ALWAYS_0			0x00000000
#define REG_BITS_MCAN_TSCC_COUNTER_USE_TCP			0x00000001
#define REG_BITS_MCAN_TSCC_COUNTER_EXTERNAL			0x00000002

// TXBAR
#define REG_BITS_MCAN_TXBAR_AR31					0x80000000
#define REG_BITS_MCAN_TXBAR_AR30					0x40000000
#define REG_BITS_MCAN_TXBAR_AR29					0x20000000
#define REG_BITS_MCAN_TXBAR_AR28					0x10000000
#define REG_BITS_MCAN_TXBAR_AR27					0x08000000
#define REG_BITS_MCAN_TXBAR_AR26					0x04000000
#define REG_BITS_MCAN_TXBAR_AR25					0x02000000
#define REG_BITS_MCAN_TXBAR_AR24					0x01000000
#define REG_BITS_MCAN_TXBAR_AR23					0x00800000
#define REG_BITS_MCAN_TXBAR_AR22					0x00400000
#define REG_BITS_MCAN_TXBAR_AR21					0x00200000
#define REG_BITS_MCAN_TXBAR_AR20					0x00100000
#define REG_BITS_MCAN_TXBAR_AR19					0x00080000
#define REG_BITS_MCAN_TXBAR_AR18					0x00040000
#define REG_BITS_MCAN_TXBAR_AR17					0x00020000
#define REG_BITS_MCAN_TXBAR_AR16					0x00010000
#define REG_BITS_MCAN_TXBAR_AR15					0x00008000
#define REG_BITS_MCAN_TXBAR_AR14					0x00004000
#define REG_BITS_MCAN_TXBAR_AR13					0x00002000
#define REG_BITS_MCAN_TXBAR_AR12					0x00001000
#define REG_BITS_MCAN_TXBAR_AR11					0x00000800
#define REG_BITS_MCAN_TXBAR_AR10					0x00000400
#define REG_BITS_MCAN_TXBAR_AR9						0x00000200
#define REG_BITS_MCAN_TXBAR_AR8						0x00000100
#define REG_BITS_MCAN_TXBAR_AR7						0x00000080
#define REG_BITS_MCAN_TXBAR_AR6						0x00000040
#define REG_BITS_MCAN_TXBAR_AR5						0x00000020
#define REG_BITS_MCAN_TXBAR_AR4						0x00000010
#define REG_BITS_MCAN_TXBAR_AR3						0x00000008
#define REG_BITS_MCAN_TXBAR_AR2						0x00000004
#define REG_BITS_MCAN_TXBAR_AR1						0x00000002
#define REG_BITS_MCAN_TXBAR_AR0						0x00000001

// TXBCR
#define REG_BITS_MCAN_TXBCR_CR31					0x80000000
#define REG_BITS_MCAN_TXBCR_CR30					0x40000000
#define REG_BITS_MCAN_TXBCR_CR29					0x20000000
#define REG_BITS_MCAN_TXBCR_CR28					0x10000000
#define REG_BITS_MCAN_TXBCR_CR27					0x08000000
#define REG_BITS_MCAN_TXBCR_CR26					0x04000000
#define REG_BITS_MCAN_TXBCR_CR25					0x02000000
#define REG_BITS_MCAN_TXBCR_CR24					0x01000000
#define REG_BITS_MCAN_TXBCR_CR23					0x00800000
#define REG_BITS_MCAN_TXBCR_CR22					0x00400000
#define REG_BITS_MCAN_TXBCR_CR21					0x00200000
#define REG_BITS_MCAN_TXBCR_CR20					0x00100000
#define REG_BITS_MCAN_TXBCR_CR19					0x00080000
#define REG_BITS_MCAN_TXBCR_CR18					0x00040000
#define REG_BITS_MCAN_TXBCR_CR17					0x00020000
#define REG_BITS_MCAN_TXBCR_CR16					0x00010000
#define REG_BITS_MCAN_TXBCR_CR15					0x00008000
#define REG_BITS_MCAN_TXBCR_CR14					0x00004000
#define REG_BITS_MCAN_TXBCR_CR13					0x00002000
#define REG_BITS_MCAN_TXBCR_CR12					0x00001000
#define REG_BITS_MCAN_TXBCR_CR11					0x00000800
#define REG_BITS_MCAN_TXBCR_CR10					0x00000400
#define REG_BITS_MCAN_TXBCR_CR9						0x00000200
#define REG_BITS_MCAN_TXBCR_CR8						0x00000100
#define REG_BITS_MCAN_TXBCR_CR7						0x00000080
#define REG_BITS_MCAN_TXBCR_CR6						0x00000040
#define REG_BITS_MCAN_TXBCR_CR5						0x00000020
#define REG_BITS_MCAN_TXBCR_CR4						0x00000010
#define REG_BITS_MCAN_TXBCR_CR3						0x00000008
#define REG_BITS_MCAN_TXBCR_CR2						0x00000004
#define REG_BITS_MCAN_TXBCR_CR1						0x00000002
#define REG_BITS_MCAN_TXBCR_CR0						0x00000001

// TXBTIE
#define REG_BITS_MCAN_TXBTIE_TIE31					0x80000000
#define REG_BITS_MCAN_TXBTIE_TIE30					0x40000000
#define REG_BITS_MCAN_TXBTIE_TIE29					0x20000000
#define REG_BITS_MCAN_TXBTIE_TIE28					0x10000000
#define REG_BITS_MCAN_TXBTIE_TIE27					0x08000000
#define REG_BITS_MCAN_TXBTIE_TIE26					0x04000000
#define REG_BITS_MCAN_TXBTIE_TIE25					0x02000000
#define REG_BITS_MCAN_TXBTIE_TIE24					0x01000000
#define REG_BITS_MCAN_TXBTIE_TIE23					0x00800000
#define REG_BITS_MCAN_TXBTIE_TIE22					0x00400000
#define REG_BITS_MCAN_TXBTIE_TIE21					0x00200000
#define REG_BITS_MCAN_TXBTIE_TIE20					0x00100000
#define REG_BITS_MCAN_TXBTIE_TIE19					0x00080000
#define REG_BITS_MCAN_TXBTIE_TIE18					0x00040000
#define REG_BITS_MCAN_TXBTIE_TIE17					0x00020000
#define REG_BITS_MCAN_TXBTIE_TIE16					0x00010000
#define REG_BITS_MCAN_TXBTIE_TIE15					0x00008000
#define REG_BITS_MCAN_TXBTIE_TIE14					0x00004000
#define REG_BITS_MCAN_TXBTIE_TIE13					0x00002000
#define REG_BITS_MCAN_TXBTIE_TIE12					0x00001000
#define REG_BITS_MCAN_TXBTIE_TIE11					0x00000800
#define REG_BITS_MCAN_TXBTIE_TIE10					0x00000400
#define REG_BITS_MCAN_TXBTIE_TIE9					0x00000200
#define REG_BITS_MCAN_TXBTIE_TIE8					0x00000100
#define REG_BITS_MCAN_TXBTIE_TIE7					0x00000080
#define REG_BITS_MCAN_TXBTIE_TIE6					0x00000040
#define REG_BITS_MCAN_TXBTIE_TIE5					0x00000020
#define REG_BITS_MCAN_TXBTIE_TIE4					0x00000010
#define REG_BITS_MCAN_TXBTIE_TIE3					0x00000008
#define REG_BITS_MCAN_TXBTIE_TIE2					0x00000004
#define REG_BITS_MCAN_TXBTIE_TIE1					0x00000002
#define REG_BITS_MCAN_TXBTIE_TIE0					0x00000001

// TXBCIE
#define REG_BITS_MCAN_TXBCIE_CFIE31					0x80000000
#define REG_BITS_MCAN_TXBCIE_CFIE30					0x40000000
#define REG_BITS_MCAN_TXBCIE_CFIE29					0x20000000
#define REG_BITS_MCAN_TXBCIE_CFIE28					0x10000000
#define REG_BITS_MCAN_TXBCIE_CFIE27					0x08000000
#define REG_BITS_MCAN_TXBCIE_CFIE26					0x04000000
#define REG_BITS_MCAN_TXBCIE_CFIE25					0x02000000
#define REG_BITS_MCAN_TXBCIE_CFIE24					0x01000000
#define REG_BITS_MCAN_TXBCIE_CFIE23					0x00800000
#define REG_BITS_MCAN_TXBCIE_CFIE22					0x00400000
#define REG_BITS_MCAN_TXBCIE_CFIE21					0x00200000
#define REG_BITS_MCAN_TXBCIE_CFIE20					0x00100000
#define REG_BITS_MCAN_TXBCIE_CFIE19					0x00080000
#define REG_BITS_MCAN_TXBCIE_CFIE18					0x00040000
#define REG_BITS_MCAN_TXBCIE_CFIE17					0x00020000
#define REG_BITS_MCAN_TXBCIE_CFIE16					0x00010000
#define REG_BITS_MCAN_TXBCIE_CFIE15					0x00008000
#define REG_BITS_MCAN_TXBCIE_CFIE14					0x00004000
#define REG_BITS_MCAN_TXBCIE_CFIE13					0x00002000
#define REG_BITS_MCAN_TXBCIE_CFIE12					0x00001000
#define REG_BITS_MCAN_TXBCIE_CFIE11					0x00000800
#define REG_BITS_MCAN_TXBCIE_CFIE10					0x00000400
#define REG_BITS_MCAN_TXBCIE_CFIE9					0x00000200
#define REG_BITS_MCAN_TXBCIE_CFIE8					0x00000100
#define REG_BITS_MCAN_TXBCIE_CFIE7					0x00000080
#define REG_BITS_MCAN_TXBCIE_CFIE6					0x00000040
#define REG_BITS_MCAN_TXBCIE_CFIE5					0x00000020
#define REG_BITS_MCAN_TXBCIE_CFIE4					0x00000010
#define REG_BITS_MCAN_TXBCIE_CFIE3					0x00000008
#define REG_BITS_MCAN_TXBCIE_CFIE2					0x00000004
#define REG_BITS_MCAN_TXBCIE_CFIE1					0x00000002
#define REG_BITS_MCAN_TXBCIE_CFIE0					0x00000001
//*****************************************************************************


//*****************************************************************************
// Device Register Bit Field Defines
//*****************************************************************************

