TexasInstruments/CC26XX-TCAN4550-EXAMPLES/source/ti/can/tcan4x5x/TCAN4x5x_Reg.h
// Modes of Operation and Pin Configuration Registers (0x0800)
// Generic masks
#define REG_BITS_DEVICE_MODE_FORCED_SET_BITS        0x00000020

// Wake pin
#define REG_BITS_DEVICE_MODE_WAKE_PIN_MASK			0xC0000000
#define REG_BITS_DEVICE_MODE_WAKE_PIN_DIS			0x00000000
#define REG_BITS_DEVICE_MODE_WAKE_PIN_RISING		0x40000000
#define REG_BITS_DEVICE_MODE_WAKE_PIN_FALLING		0x80000000
#define REG_BITS_DEVICE_MODE_WAKE_PIN_BOTHEDGES		0xC0000000

// WD_Timer (If applicable)
#define REG_BITS_DEVICE_MODE_WD_TIMER_MASK			0x30000000
#define REG_BITS_DEVICE_MODE_WD_TIMER_60MS			0x00000000
#define REG_BITS_DEVICE_MODE_WD_TIMER_600MS			0x10000000
#define REG_BITS_DEVICE_MODE_WD_TIMER_3S			0x20000000
#define REG_BITS_DEVICE_MODE_WD_TIMER_6S			0x30000000

// WD_TIMER_CLK_REF
#define REG_BITS_DEVICE_MODE_WD_CLK_MASK			0x08000000
#define REG_BITS_DEVICE_MODE_WD_CLK_20MHZ			0x00000000
#define REG_BITS_DEVICE_MODE_WD_CLK_40MHZ			0x08000000

// GPO2 Pin Configuration
#define REG_BITS_DEVICE_MODE_GPO2_MASK				0x00C00000
#define REG_BITS_DEVICE_MODE_GPO2_CAN_FAULT			0x00000000
#define REG_BITS_DEVICE_MODE_GPO2_MCAN_INT0			0x00400000
#define REG_BITS_DEVICE_MODE_GPO2_WDT				0x00800000
#define REG_BITS_DEVICE_MODE_GPO2_NINT				0x00C00000

// Test Mode Enable Bit
#define REG_BITS_DEVICE_MODE_TESTMODE_ENMASK		0x00200000
#define REG_BITS_DEVICE_MODE_TESTMODE_EN			0x00200000
#define REG_BITS_DEVICE_MODE_TESTMODE_DIS			0x00000000

// nWKRQ Pin GPO Voltage Rail COnfiguration
#define REG_BITS_DEVICE_MODE_NWKRQ_VOLT_MASK		0x00080000
#define REG_BITS_DEVICE_MODE_NWKRQ_VOLT_INTERNAL	0x00000000
#define REG_BITS_DEVICE_MODE_NWKRQ_VOLT_VIO			0x00080000

// WD_BIT
#define REG_BITS_DEVICE_MODE_WDT_RESET_BIT			0x00040000

// WD_ACTION
#define REG_BITS_DEVICE_MODE_WDT_ACTION_MASK		0x00020000
#define REG_BITS_DEVICE_MODE_WDT_ACTION_INT			0x00000000
#define REG_BITS_DEVICE_MODE_WDT_ACTION_INH_PULSE	0x00010000
#define REG_BITS_DEVICE_MODE_WDT_ACTION_WDT_PULSE	0x00020000

// CLKOUT/GPO1 Pin Mode Select
#define REG_BITS_DEVICE_MODE_GPO1_MODE_MASK			0x0000C000
#define REG_BITS_DEVICE_MODE_GPO1_MODE_GPO			0x00000000
#define REG_BITS_DEVICE_MODE_GPO1_MODE_CLKOUT		0x00004000
#define REG_BITS_DEVICE_MODE_GPO1_MODE_GPI			0x00008000

// Fail Safe Enable
#define REG_BITS_DEVICE_MODE_FAIL_SAFE_MASK			0x00002000
#define REG_BITS_DEVICE_MODE_FAIL_SAFE_EN			0x00002000
#define REG_BITS_DEVICE_MODE_FAIL_SAFE_DIS			0x00000000

// CLKOUT Prescaler
#define REG_BITS_DEVICE_MODE_CLKOUT_MASK			0x00001000
#define REG_BITS_DEVICE_MODE_CLKOUT_DIV1			0x00000000
#define REG_BITS_DEVICE_MODE_CLKOUT_DIV2			0x00001000

// GPO1 Function Select
#define REG_BITS_DEVICE_MODE_GPO1_FUNC_MASK			0x00000C00
#define REG_BITS_DEVICE_MODE_GPO1_FUNC_SPI_INT		0x00000000
#define REG_BITS_DEVICE_MODE_GPO1_FUNC_MCAN_INT1	0x00000400
#define REG_BITS_DEVICE_MODE_GPO1_FUNC_UVLO_THERM	0x00000800

// INH Pin Disable
#define REG_BITS_DEVICE_MODE_INH_MASK				0x00000200
#define REG_BITS_DEVICE_MODE_INH_DIS				0x00000200
#define REG_BITS_DEVICE_MODE_INH_EN					0x00000000

// nWKRQ Pin Configuration
#define REG_BITS_DEVICE_MODE_NWKRQ_CONFIG_MASK		0x00000100
#define REG_BITS_DEVICE_MODE_NWKRQ_CONFIG_INH		0x00000000
#define REG_BITS_DEVICE_MODE_NWKRQ_CONFIG_WKRQ		0x00000100

// Mode of Operation
#define REG_BITS_DEVICE_MODE_DEVICEMODE_MASK		0x000000C0
#define REG_BITS_DEVICE_MODE_DEVICEMODE_SLEEP		0x00000000
#define REG_BITS_DEVICE_MODE_DEVICEMODE_STANDBY		0x00000040
#define REG_BITS_DEVICE_MODE_DEVICEMODE_NORMAL		0x00000080

// WDT_EN
#define REG_BITS_DEVICE_MODE_WDT_MASK				0x00000008
#define REG_BITS_DEVICE_MODE_WDT_EN					0x00000008
#define REG_BITS_DEVICE_MODE_WDT_DIS				0x00000000

// Dev Reset
#define REG_BITS_DEVICE_MODE_DEVICE_RESET			0x00000004

// SWE_DIS: Sleep Wake Error Disable
#define REG_BITS_DEVICE_MODE_SWE_MASK				0x00000002
#define REG_BITS_DEVICE_MODE_SWE_DIS				0x00000002
#define REG_BITS_DEVICE_MODE_SWE_EN					0x00000000

// Test Mode Configuration
#define REG_BITS_DEVICE_MODE_TESTMODE_MASK			0x00000001
#define REG_BITS_DEVICE_MODE_TESTMODE_PHY			0x00000000
#define REG_BITS_DEVICE_MODE_TESTMODE_CONTROLLER	0x00000001


// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// Device Interrupt Register values (0x0820)
#define REG_BITS_DEVICE_IR_CANLGND					0x08000000
#define REG_BITS_DEVICE_IR_CANBUSOPEN				0x04000000
#define REG_BITS_DEVICE_IR_CANBUSGND				0x02000000
#define REG_BITS_DEVICE_IR_CANBUSBAT				0x01000000
//Reserved											0x00800000
#define REG_BITS_DEVICE_IR_UVSUP					0x00400000
#define REG_BITS_DEVICE_IR_UVIO						0x00200000
#define REG_BITS_DEVICE_IR_PWRON					0x00100000
#define REG_BITS_DEVICE_IR_TSD						0x00080000
#define REG_BITS_DEVICE_IR_WDTO						0x00040000
//Reserved											0x00020000
#define REG_BITS_DEVICE_IR_ECCERR					0x00010000
#define REG_BITS_DEVICE_IR_CANINT					0x00008000
#define REG_BITS_DEVICE_IR_LWU						0x00004000
#define REG_BITS_DEVICE_IR_WKERR					0x00002000
#define REG_BITS_DEVICE_IR_FRAME_OVF				0x00001000
//Reserved											0x00000800
#define REG_BITS_DEVICE_IR_CANSLNT					0x00000400
//Reserved											0x00000200
#define REG_BITS_DEVICE_IR_CANDOM					0x00000100
#define REG_BITS_DEVICE_IR_GLOBALERR				0x00000080
#define REG_BITS_DEVICE_IR_nWKRQ					0x00000040
#define REG_BITS_DEVICE_IR_CANERR					0x00000020
#define REG_BITS_DEVICE_IR_CANBUSFAULT				0x00000010
#define REG_BITS_DEVICE_IR_SPIERR					0x00000008
#define REG_BITS_DEVICE_IR_SWERR					0x00000004
#define REG_BITS_DEVICE_IR_M_CAN_INT				0x00000002
#define REG_BITS_DEVICE_IR_VTWD						0x00000001

// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// Device Interrupt Enable Values (0x0830)
#define REG_BITS_DEVICE_IE_UVCCOUT					0x00800000
#define REG_BITS_DEVICE_IE_UVSUP					0x00400000
#define REG_BITS_DEVICE_IE_UVIO						0x00200000
#define REG_BITS_DEVICE_IE_PWRON					0x00100000
#define REG_BITS_DEVICE_IE_TSD						0x00080000
#define REG_BITS_DEVICE_IE_WDTO						0x00040000
// Reserved
#define REG_BITS_DEVICE_IE_ECCERR					0x00010000
#define REG_BITS_DEVICE_IE_CANINT					0x00008000
#define REG_BITS_DEVICE_IE_LWU						0x00004000
#define REG_BITS_DEVICE_IE_WKERR					0x00002000
#define REG_BITS_DEVICE_IE_FRAME_OVF				0x00001000
//Reserved											0x00000800
#define REG_BITS_DEVICE_IE_CANSLNT					0x00000400
//Reserved											0x00000200
#define REG_BITS_DEVICE_IE_CANDOM					0x00000100
// Reserved											0x80-00
#define REG_BITS_DEVICE_IE_MASK                     0xFF69D700

#endif /* TCAN4X5X_REG_H_ */
